Number of Patients (training): 1


__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 32) 128         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 32) 128         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 32) 128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 32) 128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 128, 128, 32) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 32) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 32) 9248        activation_4[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 128, 128, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 32) 128         input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 32) 9248        activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 32) 9248        conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 32) 128         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 32) 128         conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 32) 128         conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 32) 128         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 128, 128, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128, 128, 32) 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128, 128, 32) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 128, 128, 32) 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 128 0           activation_1[0][0]               
                                                                 activation_3[0][0]               
                                                                 activation_5[0][0]               
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 64, 64, 128)  0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 64)   8256        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 64)   8256        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64, 64, 64)   256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 64)   256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64, 64, 64)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 64, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 64)   36928       activation_10[0][0]              
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 64, 64, 128)  0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 64)   8256        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 64)   36928       activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 64)   36928       conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 64)   8256        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 64)   256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 64)   256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64, 64, 64)   256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64, 64, 64)   256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 64, 64)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 64, 64, 64)   0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 256)  0           activation_7[0][0]               
                                                                 activation_9[0][0]               
                                                                 activation_11[0][0]              
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 32, 32, 256)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 32, 32, 128)  32896       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 128)  32896       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 32, 32, 128)  512         conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 128)  512         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 32, 32, 128)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 32, 32, 128)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 32, 32, 128)  147584      activation_16[0][0]              
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 32, 32, 256)  0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 128)  32896       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 128)  147584      activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 32, 32, 128)  147584      conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 128)  32896       max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 128)  512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 128)  512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 32, 32, 128)  512         conv2d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 32, 32, 128)  512         conv2d_21[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 32, 32, 128)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 32, 32, 128)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 32, 32, 128)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 32, 32, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 512)  0           activation_13[0][0]              
                                                                 activation_15[0][0]              
                                                                 activation_17[0][0]              
                                                                 activation_18[0][0]              
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 16, 16, 512)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 16, 16, 256)  131328      max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 16, 16, 256)  131328      max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 16, 16, 256)  1024        conv2d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 16, 16, 256)  1024        conv2d_23[0][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 16, 16, 256)  0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 16, 16, 256)  0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 16, 16, 256)  590080      activation_22[0][0]              
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 16, 16, 512)  0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 16, 16, 256)  131328      max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 16, 16, 256)  590080      activation_20[0][0]              
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 16, 16, 256)  590080      conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 16, 16, 256)  131328      max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 16, 16, 256)  1024        conv2d_22[0][0]                  
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 16, 16, 256)  1024        conv2d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 16, 16, 256)  1024        conv2d_27[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 16, 16, 256)  1024        conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 16, 16, 256)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 16, 16, 256)  0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 16, 16, 256)  0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 16, 16, 256)  0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 16, 16, 1024) 0           activation_19[0][0]              
                                                                 activation_21[0][0]              
                                                                 activation_23[0][0]              
                                                                 activation_24[0][0]              
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 8, 8, 1024)   0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 8, 8, 512)    524800      max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 8, 8, 512)    524800      max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 8, 8, 512)    2048        conv2d_32[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 8, 8, 512)    2048        conv2d_30[0][0]                  
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 8, 8, 512)    0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 8, 8, 512)    0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 8, 8, 512)    2359808     activation_28[0][0]              
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 8, 8, 1024)   0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 8, 512)    524800      max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 8, 512)    2359808     activation_26[0][0]              
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 8, 8, 512)    2359808     conv2d_33[0][0]                  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 8, 8, 512)    524800      max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 8, 512)    2048        conv2d_29[0][0]                  
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8, 8, 512)    2048        conv2d_31[0][0]                  
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 8, 8, 512)    2048        conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 8, 8, 512)    2048        conv2d_35[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 8, 8, 512)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 8, 8, 512)    0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 8, 8, 512)    0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 8, 8, 512)    0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 8, 8, 2048)   0           activation_25[0][0]              
                                                                 activation_27[0][0]              
                                                                 activation_29[0][0]              
                                                                 activation_30[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 16, 16, 256)  4718848     concatenate_5[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 16, 16, 1280) 0           concatenate_4[0][0]              
                                                                 conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 16, 16, 256)  327936      concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 16, 16, 256)  327936      concatenate_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 16, 16, 256)  1024        conv2d_39[0][0]                  
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 16, 16, 256)  1024        conv2d_37[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 16, 16, 256)  0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 16, 16, 256)  0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 16, 16, 256)  590080      activation_34[0][0]              
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 16, 16, 1280) 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 16, 16, 256)  327936      concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 16, 16, 256)  590080      activation_32[0][0]              
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 16, 16, 256)  590080      conv2d_40[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 16, 16, 256)  327936      max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 16, 16, 256)  1024        conv2d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 16, 16, 256)  1024        conv2d_38[0][0]                  
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 16, 16, 256)  1024        conv2d_41[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 16, 16, 256)  1024        conv2d_42[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 16, 16, 256)  0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 16, 16, 256)  0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 16, 16, 256)  0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 16, 16, 256)  0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 16, 16, 1024) 0           activation_31[0][0]              
                                                                 activation_33[0][0]              
                                                                 activation_35[0][0]              
                                                                 activation_36[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 32, 32, 128)  1179776     concatenate_7[0][0]              
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 32, 32, 640)  0           concatenate_3[0][0]              
                                                                 conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 32, 32, 128)  82048       concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 32, 32, 128)  82048       concatenate_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 32, 32, 128)  512         conv2d_46[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 32, 32, 128)  512         conv2d_44[0][0]                  
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 32, 32, 128)  0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 32, 32, 128)  0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 32, 32, 128)  147584      activation_40[0][0]              
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 32, 32, 640)  0           concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 32, 32, 128)  82048       concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 32, 32, 128)  147584      activation_38[0][0]              
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 32, 32, 128)  147584      conv2d_47[0][0]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 32, 32, 128)  82048       max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 32, 32, 128)  512         conv2d_43[0][0]                  
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 32, 32, 128)  512         conv2d_45[0][0]                  
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 32, 32, 128)  512         conv2d_48[0][0]                  
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 32, 32, 128)  512         conv2d_49[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 32, 32, 128)  0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 32, 32, 128)  0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 32, 32, 128)  0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 32, 32, 128)  0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 32, 32, 512)  0           activation_37[0][0]              
                                                                 activation_39[0][0]              
                                                                 activation_41[0][0]              
                                                                 activation_42[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 64, 64, 64)   294976      concatenate_9[0][0]              
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 64, 64, 320)  0           concatenate_2[0][0]              
                                                                 conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 64, 64, 64)   20544       concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 64, 64, 64)   20544       concatenate_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 64, 64, 64)   256         conv2d_53[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 64, 64, 64)   256         conv2d_51[0][0]                  
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 64, 64, 64)   0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 64, 64, 64)   0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 64, 64, 64)   36928       activation_46[0][0]              
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 64, 64, 320)  0           concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 64, 64, 64)   20544       concatenate_10[0][0]             
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 64, 64, 64)   36928       activation_44[0][0]              
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 64, 64, 64)   36928       conv2d_54[0][0]                  
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 64, 64, 64)   20544       max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 64, 64, 64)   256         conv2d_50[0][0]                  
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 64, 64, 64)   256         conv2d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 64, 64, 64)   256         conv2d_55[0][0]                  
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 64, 64, 64)   256         conv2d_56[0][0]                  
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 64, 64, 64)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 64, 64, 64)   0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 64, 64, 64)   0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 64, 64, 64)   0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 64, 64, 256)  0           activation_43[0][0]              
                                                                 activation_45[0][0]              
                                                                 activation_47[0][0]              
                                                                 activation_48[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 128, 128, 32) 73760       concatenate_11[0][0]             
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 128, 128, 160 0           concatenate_1[0][0]              
                                                                 conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 128, 128, 32) 46112       concatenate_12[0][0]             
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 128, 128, 32) 128         conv2d_57[0][0]                  
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 128, 128, 32) 0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 128, 128, 4)  132         activation_49[0][0]              
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, 128, 128, 4)  16          conv2d_58[0][0]                  
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 128, 128, 4)  0           batch_normalization_50[0][0]     
==================================================================================================
Total params: 22,614,772
Trainable params: 22,597,420
Non-trainable params: 17,352
__________________________________________________________________________________________________
